<a href="https://colab.research.google.com/github/DarshanS2202/Shape_AI-Data-Analysis/blob/main/Python_and_Data_Analysis.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Importing both pandas and numpy

In [38]:
import pandas as pd
import numpy as np

Reading the file and forming the dataframe

In [39]:
a=pd.DataFrame(pd.read_csv('/content/train (1).csv'))
a.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

Displaying the Dimensions of the dataframe

In [40]:
a.shape

(891, 12)

Checking the non empty cells

In [41]:
b=a.isnull().sum()
b

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

Deleting those columns in which 70% of data is missing

In [42]:
c=b[b>(30/100*a.shape[0])]
a.drop(c.index,axis=1,inplace=True)

Filling columns of numeric values with the mean of the value

In [43]:
a.fillna(a.mean(),inplace=True)
a.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       2
dtype: int64

Filling Embarked column which has charecter values with the value having highest frequency

In [44]:
a['Embarked'].describe()
a['Embarked'].fillna('S',inplace=True)
a.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64

Creating a column named FamSize to replace both SibSp and Parch representing no of Family members

In [45]:
a['FamSize']=a['SibSp']+a['Parch']
a.drop(['SibSp','Parch'],axis=1,inplace=True)

Displaying the correlation between the different columns with numerical values

In [46]:
a.corr()

             PassengerId  Survived    Pclass       Age      Fare   FamSize
PassengerId     1.000000 -0.005007 -0.035144  0.033207  0.012658 -0.040143
Survived       -0.005007  1.000000 -0.338481 -0.069809  0.257307  0.016639
Pclass         -0.035144 -0.338481  1.000000 -0.331339 -0.549500  0.065997
Age             0.033207 -0.069809 -0.331339  1.000000  0.091566 -0.248512
Fare            0.012658  0.257307 -0.549500  0.091566  1.000000  0.217138
FamSize        -0.040143  0.016639  0.065997 -0.248512  0.217138  1.000000

Creating a column Alone to indicate whether the passenger was alone or not and then check whether there is a relation between being alone and survived.

In [47]:
a['alone']=[1 if a['FamSize'][i]>0 else 0 for i in a.index]
a.groupby(['alone'])['Survived'].mean()

alone
0    0.505650
1    0.303538
Name: Survived, dtype: float64

Check the correlation between being alone and fare

In [48]:
a[['alone','Fare']].corr()

          alone      Fare
alone  1.000000 -0.271832
Fare  -0.271832  1.000000

To convert Sex into a binary format and then check the correlation between each sex and its survival rate

In [49]:
a['Sex']=[0 if a['Sex'][i]=='male' else 1 for i in a.index]
a.groupby(['Sex'])['Survived'].mean()

Sex
0    0.188908
1    0.742038
Name: Survived, dtype: float64

To check the relation between the class and the survival rate

In [50]:
a.groupby(['Embarked'])['Survived'].mean()

Embarked
C    0.553571
Q    0.389610
S    0.339009
Name: Survived, dtype: float64